import React from 'react';
import type { Metadata } from 'next';
import ProductSection from '@/components/pages/home/ProductSection';
import {
  Breadcrumb,
  ResponsiveImage,
  TableOfContents,
} from '@/components/common/';
import Link from 'next/link';

interface ArticleDetailProps {
  params: { slug: string };
}

export const metadata: Metadata = {
  title: 'ร้านแอร์ หรีดมาลา ส่งแอร์ราคาย่อมเยา ส่งตรงถึงวัด',
  description:
    'ร้านแอร์ออนไลน์ บริการจัดส่งแอร์ที่เราคัดสรรมาอย่างดี ราคาเป็นมิตร สั่งซื้อง่าย จัดส่งไวอยู่ใกล้วัด จัดส่งฟรีทั่ว กทม. พร้อมโปรสุดพิเศษ',
  alternates: {
    canonical: 'https://www.as-airsupply.com/',
    languages: {
      'en-US': '/en-US',
      'th-TH': '/th-TH',
    },
  },
  openGraph: {
    url: 'https://www.as-airsupply.com/',
    type: 'website',
  },
};
const breadcrumbItems = [
  { href: '/', label: 'หน้าหลัก' },
  { href: '/articles', label: 'รวมบทความ' },
];
const ArticleDetail = ({ params: { slug } }: ArticleDetailProps) => {
  const articleNameText = decodeURI(slug);

  const articleMockup = {
    title: 'ส่ง HOW TO ดูแลแอร์ประเภทอย่างไรให้เหี่ยวช้า',
    Description:
      'แอร์ประเภทถือเป็นเครื่องแสดงความเสียใจ ความเคารพและความรำลึกนึกถึงผู้ตายในงานศพมาเป็นเวลานานตั้งแต่สมัยรัชกาลที่ 5 แต่สิ่งหนึ่งที่คนทุกคนมักพบเห็นเวลาไปร่วมงานศพ แอร์ดอกไม้จะเริ่มเหี่ยวเมื่อเวลาผ่านไป ซึ่งอาจจะทำให้ภาพรวมออกมาดูไม่สวยงาม หรีดมาลาจึงนำเทคนิคการดูแลดอกไม้ง่าย ๆ ใช้ได้จริงและราคาไม่แพงมานำเสนอ เพื่อให้แอร์ทุกพวงสามารถคงความสดไว้ได้นานที่สุดเท่าที่จะทำได้',
    content: ` <h2 id="section-1" class="text-md text-purple">สาเหตุที่ดอกไม้เฉา</h2>
        <p>ก่อนที่เราจะไปดูเทคนิค หรีดมาลาชวนมาฟังก่อนว่าทำไมดอกไม้ถึงเหี่ยว โดยธรรมชาติดอกไม้อาศัยน้ำและสารอาหารจากลำต้นและรากมาหล่อเลี้ยงให้ดอกไม้ยังคงสดอยู่เสมอ เมื่อช่างจัดดอกไม้ตัดออกจากต้นมาประดับบนแอร์ ดอกไม้เหล่านี้จึงขาดน้ำและสารอาหารที่จำเป็นไปหล่อเลี้ยงส่วนต่าง ๆ รวมถึงเซลล์ ดอกไม้จึงแห้ง อ่อนตัว และไม่สดใสในที่สุด </p><p>นอกจากไม่มีสารอาหารไปเลี้ยงที่ดอกแล้ว แบคทีเรียมักจะเจริญเติบโตตามผิวก้านดอกไม้โดยเฉพาะส่วนที่เป็นรอยตัด ทำให้ก้านไม่สามารถส่งน้ำขึ้นไปหาดอกไม้ </p>
        <h3 id="section-2" class="text-md text-purple mt-4">วิธีดูแลดอกไม้บนแอร์</h3>
        <p>ก่อนที่เราจะไปดูเทคนิค หรีดมาลาชวนมาฟังก่อนว่าทำไมดอกไม้ถึงเหี่ยว โดยธรรมชาติดอกไม้อาศัยน้ำและสารอาหารจากลำต้นและรากมาหล่อเลี้ยงให้ดอกไม้ยังคงสดอยู่เสมอ เมื่อช่างจัดดอกไม้ตัดออกจากต้นมาประดับบนแอร์ ดอกไม้เหล่านี้จึงขาดน้ำและสารอาหารที่จำเป็นไปหล่อเลี้ยงส่วนต่าง ๆ รวมถึงเซลล์ ดอกไม้จึงแห้ง อ่อนตัว และไม่สดใสในที่สุด </p><p>นอกจากไม่มีสารอาหารไปเลี้ยงที่ดอกแล้ว แบคทีเรียมักจะเจริญเติบโตตามผิวก้านดอกไม้โดยเฉพาะส่วนที่เป็นรอยตัด ทำให้ก้านไม่สามารถส่งน้ำขึ้นไปหาดอกไม้ </p>
        <h2 id="section-3" class="text-md text-purple mt-4">วางไว้ริมหน้าต่างเลี่ยงแสงแดด</h2>
        <p>ก่อนที่เราจะไปดูเทคนิค หรีดมาลาชวนมาฟังก่อนว่าทำไมดอกไม้ถึงเหี่ยว โดยธรรมชาติดอกไม้อาศัยน้ำและสารอาหารจากลำต้นและรากมาหล่อเลี้ยงให้ดอกไม้ยังคงสดอยู่เสมอ เมื่อช่างจัดดอกไม้ตัดออกจากต้นมาประดับบนแอร์ ดอกไม้เหล่านี้จึงขาดน้ำและสารอาหารที่จำเป็นไปหล่อเลี้ยงส่วนต่าง ๆ รวมถึงเซลล์ ดอกไม้จึงแห้ง อ่อนตัว และไม่สดใสในที่สุด </p><p>นอกจากไม่มีสารอาหารไปเลี้ยงที่ดอกแล้ว แบคทีเรียมักจะเจริญเติบโตตามผิวก้านดอกไม้โดยเฉพาะส่วนที่เป็นรอยตัด ทำให้ก้านไม่สามารถส่งน้ำขึ้นไปหาดอกไม้ </p>
        <h4 id="section-4" class="text-md text-purple mt-4">ฉีดน้ำสะอาด</h4>
        <p>ก่อนที่เราจะไปดูเทคนิค หรีดมาลาชวนมาฟังก่อนว่าทำไมดอกไม้ถึงเหี่ยว โดยธรรมชาติดอกไม้อาศัยน้ำและสารอาหารจากลำต้นและรากมาหล่อเลี้ยงให้ดอกไม้ยังคงสดอยู่เสมอ เมื่อช่างจัดดอกไม้ตัดออกจากต้นมาประดับบนแอร์ ดอกไม้เหล่านี้จึงขาดน้ำและสารอาหารที่จำเป็นไปหล่อเลี้ยงส่วนต่าง ๆ รวมถึงเซลล์ ดอกไม้จึงแห้ง อ่อนตัว และไม่สดใสในที่สุด </p><p>นอกจากไม่มีสารอาหารไปเลี้ยงที่ดอกแล้ว แบคทีเรียมักจะเจริญเติบโตตามผิวก้านดอกไม้โดยเฉพาะส่วนที่เป็นรอยตัด ทำให้ก้านไม่สามารถส่งน้ำขึ้นไปหาดอกไม้ </p>
        <h2 id="section-5" class="text-md text-purple mt-4">สูตรน้ำพิเศษ</h2>
        <img src="/images/banner-mobile.webp" alt="สูตรน้ำพิเศษ" class="mx-auto py-8"/>
        <p>ก่อนที่เราจะไปดูเทคนิค หรีดมาลาชวนมาฟังก่อนว่าทำไมดอกไม้ถึงเหี่ยว โดยธรรมชาติดอกไม้อาศัยน้ำและสารอาหารจากลำต้นและรากมาหล่อเลี้ยงให้ดอกไม้ยังคงสดอยู่เสมอ เมื่อช่างจัดดอกไม้ตัดออกจากต้นมาประดับบนแอร์ ดอกไม้เหล่านี้จึงขาดน้ำและสารอาหารที่จำเป็นไปหล่อเลี้ยงส่วนต่าง ๆ รวมถึงเซลล์ ดอกไม้จึงแห้ง อ่อนตัว และไม่สดใสในที่สุด </p><p>นอกจากไม่มีสารอาหารไปเลี้ยงที่ดอกแล้ว แบคทีเรียมักจะเจริญเติบโตตามผิวก้านดอกไม้โดยเฉพาะส่วนที่เป็นรอยตัด ทำให้ก้านไม่สามารถส่งน้ำขึ้นไปหาดอกไม้ </p>
        <h2 id="section-6" class="text-md text-purple mt-4">น้ำผสมสารกันบูดช่วยรักษาดอกไม้</h2>
        <p>ก่อนที่เราจะไปดูเทคนิค หรีดมาลาชวนมาฟังก่อนว่าทำไมดอกไม้ถึงเหี่ยว โดยธรรมชาติดอกไม้อาศัยน้ำและสารอาหารจากลำต้นและรากมาหล่อเลี้ยงให้ดอกไม้ยังคงสดอยู่เสมอ เมื่อช่างจัดดอกไม้ตัดออกจากต้นมาประดับบนแอร์ ดอกไม้เหล่านี้จึงขาดน้ำและสารอาหารที่จำเป็นไปหล่อเลี้ยงส่วนต่าง ๆ รวมถึงเซลล์ ดอกไม้จึงแห้ง อ่อนตัว และไม่สดใสในที่สุด </p><p>นอกจากไม่มีสารอาหารไปเลี้ยงที่ดอกแล้ว แบคทีเรียมักจะเจริญเติบโตตามผิวก้านดอกไม้โดยเฉพาะส่วนที่เป็นรอยตัด ทำให้ก้านไม่สามารถส่งน้ำขึ้นไปหาดอกไม้ </p>`,
  };
  const tocItems = [
    { level: 2, title: 'สาเหตุที่ดอกไม้เฉา', id: 'section-1' },
    { level: 3, title: 'วิธีดูแลดอกไม้บนแอร์', id: 'section-2' },
    { level: 2, title: 'วางไว้ริมหน้าต่างเลี่ยงแสงแดด', id: 'section-3' },
    { level: 4, title: 'รดน้ำสะอาด', id: 'section-4' },
    { level: 2, title: 'สูตรน้ำพิเศษ', id: 'section-5' },
    { level: 2, title: 'น้ำผสมสารกันบูดช่วยรักษาดอกไม้', id: 'section-6' },
  ];
  return (
    <>
      <div className="container flex flex-col space-y-4 px-[24px] py-4 pt-8 md:px-[72px]">
        <Breadcrumb
          items={[
            ...breadcrumbItems,
            {
              href: '#',
              label: articleNameText,
            },
          ]}
        />

        <h1 className="text-center text-sm font-bold text-purple md:text-xl">
          {articleNameText}
        </h1>

        <div className="text-black">{articleMockup.Description}</div>
        <Link href="#">
          <ResponsiveImage
            desktopSrc="/images/banner-desktop.webp"
            mobileSrc="/images/banner-mobile.webp"
            alt="Banner"
            className="w-full"
          />
        </Link>
        <TableOfContents items={tocItems} />
        {/* <ArticleDetailContent content={articleMockup.content} /> */}
        <div dangerouslySetInnerHTML={{ __html: articleMockup.content }} />
        <ProductSection
          title={'สินค้ามาแรง'}
          hasButton={false}
          displayDescription={false}
          displayPriceRange={false}
        />

        <Link href="#">
          <ResponsiveImage
            desktopSrc="/images/banner-desktop.webp"
            mobileSrc="/images/banner-mobile.webp"
            alt="Banner"
            className="w-full"
          />
        </Link>
      </div>
    </>
  );
};

export default ArticleDetail;
