export const sitemapLinks = [
  {
    title: 'แอร์ติดผนัง',
    links: [
      'แอร์แขวนใต้ฝ้า',
      'แอร์ฝังฝ้าเพดาน 4 ทิศทาง',
      'แอร์ฝังฝ้าเพดาน 1 ทิศทาง',
      'แอร์ตู้ตั้งพื้น',
      'แอร์คอยล์เปลือย',
      'แอร์ต่อท่อลม',
      'แอร์ชนิดระบายความร้อนด้วยน้ำ',
      'แอร์ชนิดคอยล์น้ำเย็น',
      'ชิลเลอร์',
    ],
  },
  {
    title: 'แอร์ติดผนัง',
    links: [
      'แอร์แขวนใต้ฝ้า',
      'แอร์ฝังฝ้าเพดาน 4 ทิศทาง',
      'แอร์ฝังฝ้าเพดาน 1 ทิศทาง',
      'แอร์ตู้ตั้งพื้น',
      'แอร์คอยล์เปลือย',
      'แอร์ต่อท่อลม',
      'แอร์ชนิดระบายความร้อนด้วยน้ำ',
      'แอร์ชนิดคอยล์น้ำเย็น',
      'ชิลเลอร์',
    ],
  },
];
