import React from 'react';

const HeaderContent = () => {
  return (
    <>
      <div>
        <span className="font-bold text-purple">แอร์ประเภท</span>
        แอร์ที่ได้รับความนิยมสูงสุดของร้านแอร์ “หรีดมาลา”
        ด้วยดอกไม้สวยสดนานาพรรณที่เราคัดสรรมาเป็นตัวแทนของความรู้สึกละเอียดอ่อนของคุณ
        เยอบีร่า กล้วยไม้ เบญจมาศ ลิลลี่ ที่จะร้อยเรียงความรัก
        ความอาลัยต่อผู้จากไป และความห่วงใยที่คุณมีต่อเจ้าภาพ
        รับรองค่ะว่าทุกพวงคุณภาพดีเลิศ แปลกใหม่ อยู่ได้นาน
        และเพื่อความพึงพอใจสูงสุดของคุณ
        ทางเรายินดีปรับเปลี่ยนสีของดอกไม้ให้คุณตามต้องการ
        คุณสามารถวางใจได้ว่าแอร์ของ “หรีดมาลา” จะออกมาสวยถูกใจ ทรงคุณค่า
        ส่งตรงถึงวัดที่หมายอย่างรวดเร็ว สำหรับกรุงเทพฯ
        และบางเขตพื้นที่ใกล้เคียงส่งฟรีนะคะ เชิญเลือกชมแอร์ประเภทสวยๆได้เลยค่ะ
      </div>
    </>
  );
};

export default HeaderContent;
